      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. hola_mundo.
       AUTHOR. Manuel Alejandro
       INSTALLATION. Cobol/
       DATE-WRITTEN 17/11/2023
       DATE-COMPILED 17/11/2023
       REMARKS.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM hola_mundo.
