       IDENTIFICATION DIVISION.
       PROGRAM-ID. C1001.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY C1002.
        01 C-C1002           PIC X(8) VALUE 'C1002'.
       PROCEDURE DIVISION.
           ACCEPT INPUT1.
           ACCEPT INPUT2.
           DISPLAY 'ANTES DE LLAMAR A C1002'
           CALL C-C1002 USING C1002-GR.
           DISPLAY 'DESPUES DE LLAMAR A C1002'
           DISPLAY ' OUT-PUT:' OUT-PUT ' INPUT2:' INPUT2.
           GOBACK
           .
