       IDENTIFICATION DIVISION.
       PROGRAM-ID. C1002.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY C1002.
       PROCEDURE DIVISION USING C1002-GR.
           INITIALIZE C1002-SALIDA
           DISPLAY 'ENTRO A C1002' INPUT1 ' ' INPUT2 ' ' OUT-PUT
           PERFORM MICALCULO
           COMPUTE INPUT2 = INPUT2 + 10
           DISPLAY 'ANTES DE SALIR DE C1002'
           GOBACK
           .
       COPY MICALC.
       END PROGRAM C1002.
